# Northwind Traders: Performance Analysis Report

## Introduction

Northwind Traders, an international gourmet food distributor is looking needs complex insight to make strategic decisions in several aspects of the business. This project focuses on the rich [Northwind database](https://github.com/pthom/northwind_psql/tree/master), which provides a real-world-like platform for exploring and analyzing sales data. The projects focus on:

- Evaluating employee performance to boost productivity,
- Understanding product sales and category performance to optimize inventory and marketing strategies,
- Analyzing sales growth to identify trends, monitor company progress, and make more accurate forecasts,
- And evaluating customer purchase behavior to target high-value customers with promotional incentives.

Using the PostgreSQL window functions on the Northwind database, a report would be available, showcasing these essential insights to management, and consequently contributing significantly to the company's strategic decisions.

## Database Schema

Throughout this project, references are being to the schema diagram while crafting the queries for the insights. The database schema provides an overview of the Northwind database's tables, columns, relationships, and constraints, making it an essential resource for constructing accurate and efficient SQL queries. 

[Click here to view the database schema](https://github.com/pthom/northwind_psql/blob/master/ER.png).


## Database Exploration

We will begin by creating a connection to the database and acquainting ourselves with the data in the Northwind database by obtaining a list of all tables and views in the PostgreSQL database, we can query the information_schema.tables system table.

In [1]:
# ! pip install psycopg2-binary

In [2]:
%load_ext sql

In [3]:
password="" 

connection_string = f'postgresql://postgres:{password}@localhost:5432/northwind'

%sql $connection_string

### Exploring the Northwind Database - Getting to Know the Data

In [4]:
%%sql
SELECT
    table_name as name,
    table_type as type
FROM information_schema.tables
WHERE table_schema = 'public' AND table_type IN ('BASE TABLE', 'VIEW');

 * postgresql://postgres:***@localhost:5432/northwind
14 rows affected.

[('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('territories', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE')]

We have 14 entities in total in the `Northwind` database.

In [5]:
%%sql
SELECT C.*, O.*
FROM customers C
INNER JOIN orders O ON O.customer_id = C.customer_id
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('VINET', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', '26.47.15.10', '26.47.15.11', 10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 ('TOMSP', 'Toms Spezialitäten', 'Karin Josephs', 'Marketing Manager', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', '0251-031259', '0251-035695', 10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 ('HANAR', 'Hanari Carnes', 'Mario Pontes', 'Accounting Manager', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', '(21) 555-0091', '(21) 555-8765', 10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil')]

In [6]:
%%sql
SELECT O.*
	, E.first_name || ' ' || E.last_name AS employee_fullname
FROM orders O
INNER JOIN employees E ON O.employee_id = E.employee_id
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Steven Buchanan'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Michael Suyama'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', 'Margaret Peacock')]

### Ranking Employee Sales Performance
 Rank of employee performance based on their total sales.

In [7]:
%%sql
WITH employee_sales_rank_CTE AS (
	SELECT E.employee_id
		, ROUND(SUM(OD.quantity*OD.unit_price)::NUMERIC, 2) AS total_sales
	FROM orders O
	INNER JOIN order_details OD ON OD.order_id = O.order_id
	INNER JOIN employees E ON O.employee_id = E.employee_id
	GROUP BY E.employee_id
)


SELECT employee_id, total_sales
	,  ROUND(PERCENT_RANK() OVER(ORDER BY total_sales DESC)::NUMERIC,2) AS percent_rank
FROM employee_sales_rank_CTE

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, Decimal('250187.45'), Decimal('0.00')),
 (3, Decimal('213051.30'), Decimal('0.13')),
 (1, Decimal('202143.71'), Decimal('0.25')),
 (2, Decimal('177749.26'), Decimal('0.38')),
 (7, Decimal('141295.99'), Decimal('0.50')),
 (8, Decimal('133301.03'), Decimal('0.63')),
 (9, Decimal('82964.00'), Decimal('0.75')),
 (6, Decimal('78198.10'), Decimal('0.88')),
 (5, Decimal('75567.75'), Decimal('1.00'))]

`Employee 4` has the highest total sales.

### Running Total of Monthly Sales

In [8]:
%%sql

SELECT  DATE_TRUNC('month', O.Order_Date) AS month
    , ROUND(SUM(OD.unit_price * OD.quantity)::NUMERIC, 2) AS total_sales
    , ROUND(SUM(SUM(OD.unit_price * OD.quantity)) OVER (ORDER BY DATE_TRUNC('month', O.Order_Date))::NUMERIC, 2) AS running_total 
FROM orders O
INNER JOIN order_details OD ON OD.order_id = O.order_id
GROUP BY DATE_TRUNC('month', o.Order_Date)

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.datetime(1996, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('30192.10'), Decimal('30192.10')),
 (datetime.datetime(1996, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('26609.40'), Decimal('56801.50')),
 (datetime.datetime(1996, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('27636.00'), Decimal('84437.50')),
 (datetime.datetime(1996, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('41203.60'), Decimal('125641.10')),
 (datetime.datetime(1996, 11, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('49704.00'), Decimal('175345.10')),
 (datetime.datetime(1996, 12, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('50953.40'), Decimal('226298.50')),
 (datetime.datetime(1997, 1, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('66692.80'), Decimal('292991.30')),
 (datetime.datetime(1997, 2, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('41207.20'), Decimal('334198.50')),
 (datetime.datetime(1997, 3, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('39979.90'), Decimal('374178.40')),
 (datetime.datetime(1997, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('55699.39'), Decimal('429877.79')),
 (datetime.datetime(1997, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('56823.70'), Decimal('486701.49')),
 (datetime.datetime(1997, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('39088.00'), Decimal('525789.49')),
 (datetime.datetime(1997, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('55464.93'), Decimal('581254.42')),
 (datetime.datetime(1997, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('49981.69'), Decimal('631236.11')),
 (datetime.datetime(1997, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('59733.02'), Decimal('690969.13')),
 (datetime.datetime(1997, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('70328.50'), Decimal('761297.63')),
 (datetime.datetime(1997, 11, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('45913.36'), Decimal('807210.99')),
 (datetime.datetime(1997, 12, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('77476.26'), Decimal('884687.25')),
 (datetime.datetime(1998, 1, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('100854.72'), Decimal('985541.97')),
 (datetime.datetime(1998, 2, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('104561.95'), Decimal('1090103.92')),
 (datetime.datetime(1998, 3, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('109825.45'), Decimal('1199929.37')),
 (datetime.datetime(1998, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('134630.56'), Decimal('1334559.93')),
 (datetime.datetime(1998, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('19898.66'), Decimal('1354458.59'))]

### Month-Over-Month Sales Growth

In [9]:
%%sql
WITH total_sales_per_month_CTE AS (
	SELECT  DATE_TRUNC('month', O.Order_Date) AS month
		, SUM(OD.unit_price * OD.quantity) AS total_sales
	FROM orders O
	INNER JOIN order_details OD ON OD.order_id = O.order_id
	GROUP BY DATE_TRUNC('month', o.Order_Date)
),
previous_month_total_sales_per_month_CTE AS (
	SELECT month
        , LAG(total_sales) OVER (ORDER BY month) AS previous_month_sales
    FROM total_sales_per_month_CTE
)


SELECT A.month, ROUND(A.total_sales::NUMERIC, 2),
    ROUND(CASE
        WHEN previous_month_sales = 0 THEN 0
        ELSE (total_sales - previous_month_sales) / previous_month_sales
    END ::NUMERIC, 2) AS sales_growth_rate
FROM total_sales_per_month_CTE A
JOIN previous_month_total_sales_per_month_CTE B ON A.month = B.month

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.datetime(1996, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('30192.10'), None),
 (datetime.datetime(1996, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('26609.40'), Decimal('-0.12')),
 (datetime.datetime(1996, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('27636.00'), Decimal('0.04')),
 (datetime.datetime(1996, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('41203.60'), Decimal('0.49')),
 (datetime.datetime(1996, 11, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('49704.00'), Decimal('0.21')),
 (datetime.datetime(1996, 12, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('50953.40'), Decimal('0.03')),
 (datetime.datetime(1997, 1, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('66692.80'), Decimal('0.31')),
 (datetime.datetime(1997, 2, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('41207.20'), Decimal('-0.38')),
 (datetime.datetime(1997, 3, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('39979.90'), Decimal('-0.03')),
 (datetime.datetime(1997, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('55699.39'), Decimal('0.39')),
 (datetime.datetime(1997, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('56823.70'), Decimal('0.02')),
 (datetime.datetime(1997, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('39088.00'), Decimal('-0.31')),
 (datetime.datetime(1997, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('55464.93'), Decimal('0.42')),
 (datetime.datetime(1997, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('49981.69'), Decimal('-0.10')),
 (datetime.datetime(1997, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('59733.02'), Decimal('0.20')),
 (datetime.datetime(1997, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('70328.50'), Decimal('0.18')),
 (datetime.datetime(1997, 11, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('45913.36'), Decimal('-0.35')),
 (datetime.datetime(1997, 12, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('77476.26'), Decimal('0.69')),
 (datetime.datetime(1998, 1, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('100854.72'), Decimal('0.30')),
 (datetime.datetime(1998, 2, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('104561.95'), Decimal('0.04')),
 (datetime.datetime(1998, 3, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('109825.45'), Decimal('0.05')),
 (datetime.datetime(1998, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('134630.56'), Decimal('0.23')),
 (datetime.datetime(1998, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('19898.66'), Decimal('-0.85'))]

### Identifying High-Value Customers

To identify high-value customers (above-average order values) to whom we could offer targeted promotions and special offers, which could drive increased sales, improve customer retention, and attract new customers.s.

In [10]:
%%sql
WITH cx_Identification_Sales_Value_CTE AS (
	SELECT  O.customer_id
		, ROUND(SUM(OD.unit_price * OD.quantity)::NUMERIC,2) AS total_sales
	FROM orders O
	INNER JOIN order_details OD ON OD.order_id = O.order_id
	GROUP BY O.customer_id
),
sales_value_category_CTE AS (
	SELECT customer_id, total_sales
		, AVG(total_sales) OVER() AS avg_sales
		, CASE
				WHEN total_sales > AVG(total_sales) OVER() THEN 'Above Average'
				ELSE 'Average/Below Average' 
		END AS sales_value_category
	FROM cx_Identification_Sales_Value_CTE
)

SELECT customer_id, total_sales, sales_value_category
	, COUNT(*) OVER() AS count_of_saleAboveAvg
FROM sales_value_category_CTE
WHERE sales_value_category = 'Above Average'

 * postgresql://postgres:***@localhost:5432/northwind
29 rows affected.

[('OLDWO', Decimal('16325.15'), 'Above Average', 29),
 ('WARTH', Decimal('16617.10'), 'Above Average', 29),
 ('QUEEN', Decimal('30226.10'), 'Above Average', 29),
 ('RATTC', Decimal('52245.90'), 'Above Average', 29),
 ('FRANK', Decimal('28722.71'), 'Above Average', 29),
 ('LEHMS', Decimal('21282.02'), 'Above Average', 29),
 ('LINOD', Decimal('17889.55'), 'Above Average', 29),
 ('QUICK', Decimal('117483.39'), 'Above Average', 29),
 ('HUNGO', Decimal('57317.39'), 'Above Average', 29),
 ('KOENE', Decimal('31745.75'), 'Above Average', 29),
 ('MEREP', Decimal('32203.90'), 'Above Average', 29),
 ('BONAP', Decimal('23850.95'), 'Above Average', 29),
 ('HANAR', Decimal('34101.15'), 'Above Average', 29),
 ('SEVES', Decimal('17172.05'), 'Above Average', 29),
 ('BERGS', Decimal('26968.15'), 'Above Average', 29),
 ('FOLKO', Decimal('32555.55'), 'Above Average', 29),
 ('SAVEA', Decimal('115673.39'), 'Above Average', 29),
 ('BLONP', Decimal('19088.00'), 'Above Average', 29),
 ('VAFFE', Decimal('16643.80'), 'Above Average', 29),
 ('HILAA', Decimal('23611.58'), 'Above Average', 29),
 ('PICCO', Decimal('26259.95'), 'Above Average', 29),
 ('ERNSH', Decimal('113236.68'), 'Above Average', 29),
 ('SUPRD', Decimal('24704.40'), 'Above Average', 29),
 ('GREAL', Decimal('19711.13'), 'Above Average', 29),
 ('SIMOB', Decimal('18138.45'), 'Above Average', 29),
 ('LILAS', Decimal('17825.06'), 'Above Average', 29),
 ('WHITC', Decimal('29073.45'), 'Above Average', 29),
 ('RICSU', Decimal('20033.20'), 'Above Average', 29),
 ('BOTTM', Decimal('22607.70'), 'Above Average', 29)]

### Identify Percentage of Sales for Each Category

In [11]:
%%sql
WITH product_category_total_sales_CTE AS (
    SELECT C.category_name
        , ROUND(SUM(OD.unit_price * OD.quantity)::NUMERIC, 2) AS total_sales
    FROM products P
    INNER JOIN order_details OD ON P.product_id = OD.product_id
	INNER JOIN categories C ON C.category_id = P.category_id
    GROUP BY C.category_name
)
SELECT category_name, total_sales
    , ROUND((total_sales / SUM(total_sales) OVER () * 100)::NUMERIC, 2) AS percentage_of_total_sales
FROM product_category_total_sales_CTE;

 * postgresql://postgres:***@localhost:5432/northwind
8 rows affected.

[('Beverages', Decimal('286526.95'), Decimal('21.15')),
 ('Produce', Decimal('105268.60'), Decimal('7.77')),
 ('Condiments', Decimal('113694.75'), Decimal('8.39')),
 ('Grains/Cereals', Decimal('100726.80'), Decimal('7.44')),
 ('Meat/Poultry', Decimal('178188.80'), Decimal('13.16')),
 ('Confections', Decimal('177099.10'), Decimal('13.08')),
 ('Dairy Products', Decimal('251330.50'), Decimal('18.56')),
 ('Seafood', Decimal('141623.09'), Decimal('10.46'))]

### Top Products Per Category

In [12]:
%%sql
WITH product_total_sale_CTE AS (
	SELECT product_name
        , ROUND(SUM(OD.unit_price * OD.quantity)::NUMERIC, 2) AS total_sales
    FROM products P
    INNER JOIN order_details OD ON P.product_id = OD.product_id
    GROUP BY P.product_name
)

SELECT product_name, total_sales, row_num
FROM(
	SELECT product_name, total_sales
		, ROW_NUMBER() OVER (ORDER BY total_sales DESC) AS row_num
	FROM product_total_sale_CTE
)A
WHERE row_num <= 3;

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('Côte de Blaye', Decimal('149984.20'), 1),
 ('Thüringer Rostbratwurst', Decimal('87736.40'), 2),
 ('Raclette Courdavault', Decimal('76296.00'), 3)]